Repository: eugeneai/papers-2019
Catalog: KONT/tr/en-ru/en-ru-omegat.tmx
Source language: en_us
Languages: ru_ru

source: This is a powerful LogTalk abstraction instrument, which reduces necessity of adapter object creation in dynamic memory.
ru_ru: Это мощный инструмент абстрагирования LogTalk, который отменяет необходимость создавать объекты-адаптеры протокола в динамической памяти.

source: This is reflected as connections between blocks in the diagram.
ru_ru: В диаграмме это отражается в виде связей между блоками.

source: This is why, we decided to represent the source model data in the SW framework too, enriching the existing knowledge with a specific domains.
ru_ru: Именно поэтому, было решено использовать СВ как основной формат представления моделей, что обогащают имеющиеся знания предметных областях дополнительной спецификой.

source: This results in a globally approved in various software projects knowledge and data base, the common foundation of a domain description.
ru_ru: В результате, отрасль ИТ постепенно на глобальном уровне накапливает и стандартизирует знания и данные предметных областей.

source: This structure can be constructed with a special form <namespace>:<identifier>.
ru_ru: URI также задается при помощи специальной формы <namespace>:<identifier>.

source: Thus, the majority of the presented techniques are closed with respect of XMI file format: the source data and the result of the transaction are represented in it, and it goes beyond only on the stage of the source code generation.
ru_ru: Таким образом, большинство представленных методов является замкнутым относительно файла формат XMI: исходные данные и результат трансформации представлены, в основном, в этом формате, выход за границу формата происходит только на этапе генерации кода.

source: Transformation generates Java modules implementing structural and operational features of blocks.
ru_ru: Трансформация порождает модули Java, реализующие структуру и функции блоков.

source: Transformation process is organized as a scenario of connected transformational objects (in terms of LogTalk).
ru_ru: Процесс трансформации организован в виде сценария, составленного из объектов, посылающих сообщения друг другу.

source: UML standard of version 2.4 fixed this observation, allowing formal definition the set of tag values for user-defined stereotypes.
ru_ru: Стандарт UML версии 2.4 этот момент учтен, и современные средства визуального моделирования позволяют формально определять данный перечень для собственных стереотипов.

source: UML-2.4 explicit stereotype descriptions is a powerful tool for attributing entities with additional information.
ru_ru: Таким образом, явная спецификация стереотипов в UML-2.4 -- это мощный инструмент расширения семантики элементов визуальных моделей.

source: Unfortunately, the structure of this file is too complex to analyze and contained only declarative parts of the sources (types, classes with field and method declarations and external variables).
ru_ru: Но, к сожалению, структура этого файла является слишком сложной для анализа и содержит лишь декларативные части источников (типы, классы с полями и объявлениями методов, внешние переменные).

source: Usage of object-oriented logical language LogTalk allows us powerfully structuring and manipulate knowledge base.
ru_ru: Использование объектно-ориентированного логического языка LogTalk позволяет нам активно использовать структурирование и управление базой знаний.

source: Usage of such kind of transformation approach allows us to develop software system carcasses on the level of abstract models, involve various sources of model data in the transformation, define and structuring conversion knowledge as objects.
ru_ru: Использования такого подхода к трансформации позволяет разрабатывать исходный код каркасов программных систем еще на этапе общего дизайна, включать в трансформацию различные источники модельных данных, задавать и структурировать знания.

source: User-defined stereotypes can express various aspects of classes, e.g., we can define the storage class as an ORM for a class by <<RDBMSRecord>> stereotype.
ru_ru: Новые стереотипы могут задавать разработчики, например, при разработке ИС удобно использовать ORM, при этом тот факт, что конкретный класс будет отображаться в запись реляционной базы данных можно при помощи назначенного ему стереотипа <<RDBMSRecord>>.

source: Using RDF, we can change the tag name to dc:title and value can be interpreted as URI, e.g., to a DBPedia object.
ru_ru: При использовании RDF имена тегов можно задавать в форме dc:title, а значение тега интерпретировать и как литерал и как URI, например, на объект DBPedia.

source: Various notation can be used to represent models, such as UML, SysML, CMMN, BPMN2.0, as well as RDF graphs and analyzed source code, having implemented a corresponding converter.
ru_ru: При этом существует возможность использования различных нотаций, например таких, как UML, SysML, CMMN, BPMN2.0, графов RDF и результаты анализа исходного кода других систем, если реализовать соответствующий модкль преобразования.

source: We presented an approach to implementation of transformation procedures for Model Driven Architecture (MDA) that mediates most convenient features of logical and object-oriented programming, representation of source model data as RDF graphs.
ru_ru: В докладе представлен подход к реализации процедуры трансформации, поддерживающей подход Model Driven Architecture (MDA), который опосредует большинство удобных свойств логического и объектно-ориентированного программирования, представление данных исходной модели данных в виде графов RDF.

source: We propose a more general approach, where for all model sources a converter to RDF format, the standard SW data and knowledge representation, and the transformation is defined as object-oriented logical program in the LogTalk language.
ru_ru: Мы предлагаем более общий подход, где для всех исходных типов моделей разрабатываются конвертера в формат RDF, в стандартное представление данных и знаний в СВ, а трансформация программируется в виде объектно-ориентированной логической программы на языке LogTalk.

source: We specially disallow inserting |item|s into code blocks, as it will make object and its database more complex.
ru_ru: Вставка специально запрещена, так как это усложняет реализацию.

source: We tried to use a version of GCC, which outputs abstract syntax tree as an XML file.
ru_ru: Мы пытались использовать специальную версию компилятора GCC<Р0>, который представляет абстрактное синтаксическое дерево в виде XML-файла.

source: We use this structural data of the source code of Mothur for analysis and conversion it to a RDF graph, resulting in the description of all the Mothur modules.
ru_ru: Анализ этой дополнительной информации дает данные о структуре межмодульного взаимодействия, которые активно используются при трансформации.

source: When implementing complex software, which are composed from existing subsystems, their specifications can be additional sources of model data.
ru_ru: При реализации сложных программных систем, их иногда составляют из действующих модулей, спецификации этих модулей могут выступать дополнительными источниками модельных данных.

source: With these MDA tools now we will develop a programming techniques aimed at reuse of knowledge and their specialization, thus, supporting programming traditions used in small information system developing companies and collectives.
ru_ru: Разработанная методика проектирования инструментов MDA будет развиваться в направлении формирования приемов программирования, направленных на повторное использование знаний и их специализации, таким образом, поддерживая традиции программирования, используемые при проектировании небольших информационных систем для развивающихся компаний.

source: model driven architecture, logical inference, resource description framework, LogTalk
ru_ru: модельно-управляемаяархитектура, логический вывод, RDF, LogTalk

source: {Matrosov Institute for System Dynamics and Control Theory of SB RAS,
ru_ru: {Институт динамики систем и теории управления СО РАН,

source: {Architecture of MDA transformational tools}
ru_ru: {Архитектура инструментальных средств трансформации}

source: {Defining rules of transformation}
ru_ru: {Определение правил преобразования}

source: {Evgeny Cherkashin, Alexey Shigarov, Viacheslav Paramonov
ru_ru: Евгений Черкашин, Алексей Шигаров, Вячеслав Парамонов

source: {SWI-Prolog Semantic Web Library}
ru_ru: {Библиотека СВ SWI-Prolog-а}
